@DFurnes Can you take a quick 👀 at [this](https://github.com/DoSomething/infrastructure/pull/209/commits/00e502dff28f2363c405203f4bfe310ea25e832d) and [this](https://github.com/DoSomething/infrastructure/pull/209/files#diff-9c2578982d1e7190ae7d08c9f7b03e61R495-R517) to verify looks good? 

Output of `make plan`:
```
Terraform will perform the following actions:

  # module.quasar.aws_cloudwatch_log_subscription_filter.papertrail_subscription will be created
  + resource "aws_cloudwatch_log_subscription_filter" "papertrail_subscription" {
      + destination_arn = "******"
      + distribution    = "ByLogStream"
      + id              = (known after apply)
      + log_group_name  = "/aws/vpn/quasar"
      + name            = "papertrail_forwarder"
      + role_arn        = (known after apply)
    }

  # module.quasar.aws_ec2_client_vpn_endpoint.quasar-vpn-endpoint will be updated in-place
  ~ resource "aws_ec2_client_vpn_endpoint" "quasar-vpn-endpoint" {
        client_cidr_block      = "172.22.0.0/22"
        description            = "Quasar-Client-VPN"
        dns_name               = "********"
        id                     = "cvpn-endpoint-09124d7307e277c34"
        server_certificate_arn = "********"
        split_tunnel           = true
        tags                   = {}
        transport_protocol     = "udp"

        authentication_options {
            root_certificate_chain_arn = "*******"
            type                       = "certificate-authentication"
        }

      ~ connection_log_options {
            cloudwatch_log_group  = "/aws/vpn/quasar"
          - cloudwatch_log_stream = "******* -> null
            enabled               = true
        }
    }

  # module.quasar.aws_lambda_permission.allow_cloudwatch[0] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action        = "lambda:InvokeFunction"
      + function_name = "arn:aws:lambda:******"
      + id            = (known after apply)
      + principal     = "logs.us-east-1.amazonaws.com"
      + source_arn    = "arn:aws:logs:us-east-1:******"
      + statement_id  = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.